#include <stdio.h> //นำเข้าฟังก์ชั่นทั่วไปจากLibraly

int deci; //กำหนดตัวแปร ตัวเลข สำหรับรับค่าเลขฐานสิบ
int bi[64]; //กำหนดตัวแปร สำหรับเก็บค่าที่เป็นเลขฐานสอง
int i; //กำหนดตัวแปรสำหรับนับรอบ

int main(){ //ฟังก์ชั่นพื้นฐาน
    printf("input decimal = "); //ส่งออกข้อความขอค่าเลขฐานสิบจากผู้ใช้
    scanf("%d",&deci);//รับค่าเลขฐานสิบ
    do{ //ทำ
        bi[i]=deci%2; //กำหนดค่าในอาร์เรย์ไบนารี่ เป็นเศษเหลือจากค่าเลขฐานสิบหารด้วย 2
        deci = deci/2; // กำหนดค่าเลขฐานสิบใหม่เป็น เลขฐานสิบหารด้วย 2
        i++; // เพิ่มค่า i ขึ้น 1
    }
    while(deci>0); //เมื่อเลขฐานสิบ มากกว่า 0 
    for(int j=i;j>=0;j--){ //วนซ้ำ เมื่อ ค่าเริ่มต้นเท่ากับ i  ในระหว่างที่มีค่ามากกว่าหรือเท่ากับ 0 และค่าลดลงรอบละ 1
        printf("%d",bi[j]); //ส่งออกค่าไบนารี่
    }
}