#include "fullstd.h" //นำเข้า ซอร์สโค้ดจากไฟล์อื่น โดยไฟล์ที่ใช้นี้เป็นไฟล์เฉพาะ ที่สร้างขึ้นเอง โดยรวมซอร์สโค้ดหลายๆ ไฟล์เข้าด้วยกัน

int a,b,h; //กำหนดตัวแปล เป็นประเภทเลขจำนวนจริง

int main() { //ฟังก์ชันหลักของโปรแกรม ที่จะทำงานเมื่อเริ่มรันโปรแกรม
  printf("input a"); //ส่งออกข้อความผ่าน output ว่าจะรับค่า a
  scanf("%d",&a); //รับค่า a ในที่นี้ใช้แทนค่า ด้านขนานด้านที่หนึ่งของสี่เหลี่ยมคางหมู
  printf("input b"); //ส่งออกข้อความผ่าน output ว่าจะรับค่า b
  scanf("%d",&b); //รับค่า b ในที่นี้ใช้แทนค่า ด้านขนานด้านที่สองของสี่เหลี่ยมคางหมู
  printf("input h"); //รับค่า h ในที่นี้ใช้แทนค่า ความสูงของสี่เหลี่ยมคางหมู
  scanf("%d",&h); //รับค่า h ในที่นี้ใช้แทนค่า ความสูงของสี่เหลี่ยมคางหมู
  printf("Area is %f\n", (h*(a+b)*0.5)); //คำนวนคำตอบ พร้อมส่งออก ด้วยสูตร 1/2*(a+b)h
}