#include <stdio.h> //นำเข้าฟังก์ชั่นทั่วไปจากLibraly

char character ='A'; //กำหนดตัวแปร ตัวอักษร
int count; //กำหนดตัวแปร จำนวน
int main(){ //ฟังก์ชั่นพื้นฐาน
    printf("input count"); //ส่งออกข้อความขอค่าจำนวน
    scanf("%d",&count); //รับค่า จำนวน
    for(int i=count;i>0;i--){ //วนซ้ำ เมื่อ ค่าเริ่มต้นเท่ากับค่าจำนวน ระหว่างที่มากกว่า 0 และลดลงทีละ 1
        for(int j=0;j<i;j++){ //วนซ้ำ เมื่อ ค่าเริ่มต้นเท่ากับ0 ระหว่างที่น้อยกว่าค่าของfor loopแรก และลดลงทีละ 1
            printf("%c ",(character+j)); //ส่งออกข้อความ ตัวอักษร+ค่าของ for loop ที่ 2
        }
        printf("\n"); //จบบรรทัด
    }

}